const jwt = require("jsonwebtoken");

const decodeToken = (token) => {
  return jwt.verify(token, process.env.JWTTOKEN, (err, decoded) => {
    return decoded.sub;
  });
};

const newObjectivesData = [
  {
    heading: "שלב א’",
    stage: 1,
    chapters: [
      {
        chapterNo: 1,
        length: 9,
        chapterName: "פרק א’",
        rating: [0, 0, 0, 0, 0, 0, 0, 0, 0],
        topic: [
          "כניסה לרכב ויציאה ממנו",
          "מערכות התפעול",
          "מערכות הבטיחות",
          "מערכות הבקרה והמידע",
          "ישיבה נכונה ופעולות הכנה לנסיעה",
          "התנעת מנוע",
          "תחילת נסיעה והאצה",
          "האטה ועצירה",
          "אבטחת הרכב והדממת המנוע בסיום נסיעה",
        ],
        message: ["", "", "", "", "", "", "", "", ""],
      },
      {
        chapterNo: 2,
        length: 5,
        chapterName: "פרק ב’",
        rating: [0, 0, 0, 0, 0],
        topic: [
          "היגוי בקו ישר",
          "היגוי בהפניות הרכב",
          "העלאת הילוכים",
          "שימוש ידני בתיבת הילוכים אוטומטית",
          "עצירת הרכב בכל ומכל הילוך",
        ],
        message: ["", "", "", "", ""],
      },
      {
        chapterNo: 3,
        length: 6,
        chapterName: "פרק ג’",
        rating: [0, 0, 0, 0, 0, 0],
        topic: [
          "נסיעה במהירות נמוכה בעזרת הבלם",
          "הורדה מהילוך 2 להילוך 1 בעת הנסיעה",
          "עצירת מטרה בנסיעה קדימה",
          "תחילת נסיעה במורד תלול",
          "תחילת נסיעה במעלה תוך שימוש בבלם העזר",
          "נסיעה לאחור בקו ישר",
        ],
        message: ["", "", "", "", "", ""],
      },
    ],
  },
  {
    heading: "שלב ב’",
    stage: 2,
    chapters: [
      {
        chapterNo: 1,
        length: 9,
        chapterName: "פרק א’",
        rating: [0, 0, 0, 0, 0, 0, 0, 0, 0],
        topic: [
          "כניסה לרכב ויציאה ממנו",
          "מערכות התפעול",
          "מערכות הבטיחות",
          "מערכות הבקרה והמידע",
          "ישיבה נכונה ופעולות הכנה לנסיעה",
          "התנעת מנוע",
          "תחילת נסיעה והאצה",
          "האטה ועצירה",
          "אבטחת הרכב והדממת המנוע בסיום נסיעה",
        ],
        message: ["", "", "", "", "", "", "", "", ""],
      },
      {
        chapterNo: 2,
        length: 5,
        chapterName: "פרק ב’",
        rating: [0, 0, 0, 0, 0],
        topic: [
          "היגוי בקו ישר",
          "היגוי בהפניות הרכב",
          "העלאת הילוכים",
          "שימוש ידני בתיבת הילוכים אוטומטית",
          "עצירת הרכב בכל ומכל הילוך",
        ],
        message: ["", "", "", "", ""],
      },
      {
        chapterNo: 3,
        length: 6,
        chapterName: "פרק ג’",
        rating: [0, 0, 0, 0, 0, 0],
        topic: [
          "נסיעה במהירות נמוכה בעזרת הבלם",
          "הורדה מהילוך 2 להילוך 1 בעת הנסיעה",
          "עצירת מטרה בנסיעה קדימה",
          "תחילת נסיעה במורד תלול",
          "תחילת נסיעה במעלה תוך שימוש בבלם העזר",
          "נסיעה לאחור בקו ישר",
        ],
        message: ["", "", "", "", "", ""],
      },
    ],
  },
  {
    heading: "שלב ג’",
    stage: 3,
    chapters: [
      {
        chapterNo: 1,
        length: 9,
        chapterName: "פרק א’",
        rating: [0, 0, 0, 0, 0, 0, 0, 0, 0],
        topic: [
          "כניסה לרכב ויציאה ממנו",
          "מערכות התפעול",
          "מערכות הבטיחות",
          "מערכות הבקרה והמידע",
          "ישיבה נכונה ופעולות הכנה לנסיעה",
          "התנעת מנוע",
          "תחילת נסיעה והאצה",
          "האטה ועצירה",
          "אבטחת הרכב והדממת המנוע בסיום נסיעה",
        ],
        message: ["", "", "", "", "", "", "", "", ""],
      },
      {
        chapterNo: 2,
        length: 5,
        chapterName: "פרק ב’",
        rating: [0, 0, 0, 0, 0],
        topic: [
          "היגוי בקו ישר",
          "היגוי בהפניות הרכב",
          "העלאת הילוכים",
          "שימוש ידני בתיבת הילוכים אוטומטית",
          "עצירת הרכב בכל ומכל הילוך",
        ],
        message: ["", "", "", "", ""],
      },
      {
        chapterNo: 3,
        length: 6,
        chapterName: "פרק ג’",
        rating: [0, 0, 0, 0, 0, 0],
        topic: [
          "נסיעה במהירות נמוכה בעזרת הבלם",
          "הורדה מהילוך 2 להילוך 1 בעת הנסיעה",
          "עצירת מטרה בנסיעה קדימה",
          "תחילת נסיעה במורד תלול",
          "תחילת נסיעה במעלה תוך שימוש בבלם העזר",
          "נסיעה לאחור בקו ישר",
        ],
        message: ["", "", "", "", "", ""],
      },
    ],
  },
  {
    heading: "שלב ד’",
    stage: 4,
    chapters: [
      {
        chapterNo: 1,
        length: 9,
        chapterName: "פרק א’",
        rating: [0, 0, 0, 0, 0, 0, 0, 0, 0],
        topic: [
          "כניסה לרכב ויציאה ממנו",
          "מערכות התפעול",
          "מערכות הבטיחות",
          "מערכות הבקרה והמידע",
          "ישיבה נכונה ופעולות הכנה לנסיעה",
          "התנעת מנוע",
          "תחילת נסיעה והאצה",
          "האטה ועצירה",
          "אבטחת הרכב והדממת המנוע בסיום נסיעה",
        ],
        message: ["", "", "", "", "", "", "", "", ""],
      },
      {
        chapterNo: 2,
        length: 5,
        chapterName: "פרק ב’",
        rating: [0, 0, 0, 0, 0],
        topic: [
          "היגוי בקו ישר",
          "היגוי בהפניות הרכב",
          "העלאת הילוכים",
          "שימוש ידני בתיבת הילוכים אוטומטית",
          "עצירת הרכב בכל ומכל הילוך",
        ],
        message: ["", "", "", "", ""],
      },
      {
        chapterNo: 3,
        length: 6,
        chapterName: "פרק ג’",
        rating: [0, 0, 0, 0, 0, 0],
        topic: [
          "נסיעה במהירות נמוכה בעזרת הבלם",
          "הורדה מהילוך 2 להילוך 1 בעת הנסיעה",
          "עצירת מטרה בנסיעה קדימה",
          "תחילת נסיעה במורד תלול",
          "תחילת נסיעה במעלה תוך שימוש בבלם העזר",
          "נסיעה לאחור בקו ישר",
        ],
        message: ["", "", "", "", "", ""],
      },
    ],
  },
];

module.exports = { decodeToken, newObjectivesData };
